       01 EMPFILE-RECORD.                                               00010001
          05 EMP-ID       PIC X(05).                                    00020001
          05 EMP-NAME     PIC X(14).                                    00030001
          05 EMP-DESG     PIC X(05).                                    00040001
          05 EMP-DEPT     PIC X(05).                                    00050001
          05 EMP-LOC      PIC X(05).                                    00060001
          05 EMP-SALARY   PIC X(10).                                    00070001
          05 FILLER       PIC X(36).                                    00080001
